[
  {
    "timestamp": "2025-10-11T08:08:05.552Z",
    "summary": "Redesigned luxury multi-tier header & concierge navigation system.",
    "details": [
      "Introduced a glassmorphism top bar, dynamic stats ribbon, and reimagined desktop call-to-actions in src/components/Header.tsx.",
      "Refined header navigation styling to adapt on scroll and align with the elevated brand experience in src/components/header/NavigationMenu.tsx.",
      "Curated a concierge-focused mobile drawer with signature journeys, services, and contact channels."
    ],
    "files": [
      "src/components/Header.tsx",
      "src/components/header/NavigationMenu.tsx"
    ]
  },
  {
    "timestamp": "2025-10-12T14:22:36.762Z",
    "summary": "Restored the original multi-column Recharge footer across the site.",
    "details": [
      "Replaced the concierge glassmorphism footer with the legacy explore/services/about columns in src/components/ui/RechargeFooter.tsx.",
      "Reinstated the static contact details, privacy/terms quick links, and animated social icons to match the pre-redesign experience.",
      "Mounted the AIFAQChatbot globally from the footer so the floating travel assistant remains accessible."
    ],
    "files": [
      "src/components/ui/RechargeFooter.tsx"
    ]
  },
  {
    "timestamp": "2025-10-12T14:31:44.446Z",
    "summary": "Reimagined the Recharge footer with a Sri Lankan jungle concierge theme.",
    "details": [
      "Built a hero panel featuring Leopard Conservancy messaging, ranger-led safari highlights, and MCP concierge calls-to-action in src/components/ui/RechargeFooter.tsx.",
      "Structured supporting sections for newsletter capture, concierge contact capsule, social lounge, navigation clusters, and conservation stat tiles.",
      "Maintained the floating AIFAQChatbot mount and ensured scroll-to-top plus privacy/terms links remain accessible."
    ],
    "files": [
      "src/components/ui/RechargeFooter.tsx"
    ]
  },
  {
    "timestamp": "2025-10-12T16:01:36.858Z",
    "summary": "Streamlined the site header to prevent stacked double-bar appearance.",
    "details": [
      "Removed the desktop announcement bar and stat ribbon from src/components/Header.tsx so only a single nav row renders.",
      "Relocated concierge contact chips and the language switcher into the primary action cluster, keeping the layout compact on scroll.",
      "Preserved existing desktop navigation, mobile drawer logic, and MCP concierge hooks while simplifying the visual hierarchy."
    ],
    "files": [
      "src/components/Header.tsx"
    ]
  },
  {
    "timestamp": "2025-10-13T07:34:39.679Z",
    "summary": "Ensured every routed page renders the global footer without manual duplication.",
    "details": [
      "Introduced a withSiteChrome helper in src/App.tsx that wraps selected routes with Header and Footer.",
      "Applied the wrapper to experience listings, destination shells, admin utilities, and other pages that previously omitted the footer.",
      "Extended the React imports to support ComponentType and hydrated the new layout without touching pages that already include their own footer."
    ],
    "files": [
      "src/App.tsx"
    ]
  },
  {
    "timestamp": "2025-10-16T15:27:12Z",
    "summary": "Cleared blocking ESLint errors by aligning lint rules with the codebase and patching problem spots.",
    "details": [
      "Relaxed strict any/require import checks in eslint.config.js so existing typings build cleanly.",
      "Converted Tailwind plugin usage to ESM imports and removed redundant @ts-ignore/regex escapes across input validation utilities.",
      "Corrected assorted lint violations (case block declarations, empty interfaces, unsafe assertions, prefer-const, hasOwnProperty) across core components and services to allow eslint . to pass without errors."
    ],
    "files": [
      "eslint.config.js",
      "tailwind.config.ts",
      "admin/src/components/admin/panel/ImageGenerationDialog.tsx",
      "admin/src/utils/inputValidation.ts",
      "src/components/ecotourism/EcoBookingWidget.tsx",
      "src/components/ErrorBoundary.tsx",
      "src/components/YaluRechargeAgent.tsx",
      "src/components/analytics/GoogleAnalytics.tsx",
      "src/components/ui/command.tsx",
      "src/components/ui/input.tsx",
      "src/components/ui/textarea.tsx",
      "src/data/travelGuideContent.ts",
      "src/lib/cms-queries.ts",
      "src/lib/enhanced-seo-service.ts",
      "src/modules/transfers/context/TransferContext.tsx",
      "src/pages/WildlifeExperience.tsx",
      "src/types/global.d.ts",
      "src/utils/inputValidation.ts",
      "functions/src/contentAutomation.ts"
    ]
  },
  {
    "timestamp": "2025-10-17T00:00:00.000Z",
    "summary": "Confirmed hosted admin panel endpoint for Recharge Travels operations.",
    "details": [
      "Referenced ADMIN_CREDENTIALS.md to capture the deployed admin panel URL at recharge-travels-73e76-admin.web.app for future access."
    ],
    "files": [
      "ADMIN_CREDENTIALS.md"
    ]
  },
  {
    "timestamp": "2025-11-27T15:51:38Z",
    "summary": "Updated Recharge Travels branding to the new official logo across assets, UI, and SEO metadata.",
    "details": [
      "Replaced the public logo asset and favicon bundle with the latest logo from rechargetravels.com and regenerated the favicon.ico sprites.",
      "Pointed header/footer components and admin defaults to the on-site /logo.png instead of legacy imgur fallbacks, improving resilience and consistency.",
      "Aligned structured data and SEO helpers (blog/homepage schema, transfer structured data, landing doc) to the new https://www.rechargetravels.com/logo.png endpoint with refreshed alt copy."
    ],
    "files": [
      "public/logo.png",
      "public/favicon.png",
      "public/favicon.ico",
      "src/components/header/Logo.tsx",
      "src/components/footer/FooterBrand.tsx",
      "src/components/footer/FooterMobile.tsx",
      "src/components/footer/FooterAbout.tsx",
      "src/components/admin/AdminImageManager.tsx",
      "src/components/seo/BlogSEO.tsx",
      "src/components/seo/HomepageSchema.tsx",
      "src/utils/structuredData.ts",
      "LANDING_PAGE_SEO_OPTIMIZATION.md"
    ]
  },
  {
    "timestamp": "2025-11-27T16:35:00Z",
    "summary": "Bypassed cached legacy logo by versioning the asset and redeployed after fixing GroupTransport JSX.",
    "details": [
      "Added new versioned logo assets (now /logo-v2.png) and pointed all UI fallbacks, favicons, manifest icons, and structured data to the versioned URL to bust client caches.",
      "Adjusted header/footer logic to prefer the new logo even when Firestore still stores old URLs, and updated admin defaults/placeholders to the new domain path.",
      "Fixed JSX tag mismatches in GroupTransport hero section to restore successful builds, then rebuilt and redeployed hosting + Firestore rules/indexes to recharge-travels-73e76."
    ],
    "files": [
      "public/logo-new.png",
      "public/logo-v2.png",
      "public/manifest.json",
      "index.html",
      "src/components/header/Logo.tsx",
      "src/components/footer/FooterBrand.tsx",
      "src/components/footer/FooterMobile.tsx",
      "src/components/footer/FooterAbout.tsx",
      "src/components/admin/AdminImageManager.tsx",
      "src/components/seo/BlogSEO.tsx",
      "src/components/seo/HomepageSchema.tsx",
      "src/components/seo/ComprehensiveSEO.tsx",
      "src/utils/structuredData.ts",
      "src/lib/seo-service.ts",
      "src/lib/enhanced-seo-service.ts",
      "src/pages/TravelGuide.tsx",
      "src/pages/transport/GroupTransport.tsx"
    ]
  },
  {
    "timestamp": "2025-11-28T00:00:00Z",
    "summary": "Added a daily SEO indexing agent and aligned sitemap sources to the custom domain.",
    "details": [
      "Introduced a Python SEO agent that rebuilds sitemap.xml from seed routes, existing entries, and optional crawling, then submits to Google Search Console and can ping IndexNow.",
      "Documented setup for the agent (service account, cron example, IndexNow key) and captured Python dependencies in a dedicated requirements file.",
      "Updated the sitemap generator base URL and robots.txt sitemap pointer to www.rechargetravels.com to keep automated submissions canonical."
    ],
    "files": [
      "scripts/seo_indexing_agent.py",
      "scripts/seo_indexing_agent_requirements.txt",
      "scripts/SEO_AGENT.md",
      "src/lib/sitemap-generator.ts",
      "public/robots.txt"
    ]
  },
  {
    "timestamp": "2025-11-28T06:02:20Z",
    "summary": "Added TripAdvisor tours catalog page and homepage showcase.",
    "details": [
      "Created TripAdvisor-linked tour dataset with USD pricing and metadata in src/data/tripAdvisorTours.ts.",
      "Built TripAdvisorTours page with filters, sorting, ratings, and direct booking links plus SEO metadata at src/pages/TripAdvisorTours.tsx.",
      "Added two-row TripAdvisor tours highlight section to the homepage and routing to /tours/tripadvisor via src/components/homepage/TripAdvisorHighlights.tsx, src/pages/Index.tsx, and src/App.tsx."
    ],
    "files": [
      "src/data/tripAdvisorTours.ts",
      "src/pages/TripAdvisorTours.tsx",
      "src/components/homepage/TripAdvisorHighlights.tsx",
      "src/pages/Index.tsx",
      "src/App.tsx"
    ]
  },
  {
    "timestamp": "2025-11-28T06:13:03Z",
    "summary": "Limited TripAdvisor showcases to Recharge-operated listings.",
    "details": [
      "Tagged TripAdvisor tour data with the Recharge operator profile URL so only our listings surface.",
      "Filtered TripAdvisorTours page and homepage highlights to the Recharge profile and pointed CTAs to the operator review URL."
    ],
    "files": [
      "src/data/tripAdvisorTours.ts",
      "src/pages/TripAdvisorTours.tsx",
      "src/components/homepage/TripAdvisorHighlights.tsx"
    ]
  },
  {
    "timestamp": "2025-11-28T10:03:01Z",
    "summary": "Wired TripAdvisor tours to Firestore with Recharge-only filtering.",
    "details": [
      "Added useTripAdvisorTours hook to pull tours from the Firestore collection tours_tripadvisor with Recharge operator defaults and graceful static fallback.",
      "Updated TripAdvisorTours page to consume Firestore data, show loading/error states, and keep USD pricing counts accurate.",
      "Updated homepage TripAdvisorHighlights to surface Firestore data when available while keeping Recharge-only filtering."
    ],
    "files": [
      "src/hooks/useTripAdvisorTours.ts",
      "src/pages/TripAdvisorTours.tsx",
      "src/components/homepage/TripAdvisorHighlights.tsx"
    ]
  },
  {
    "timestamp": "2025-11-28T10:15:00Z",
    "summary": "Provided a Firestore seeding script for TripAdvisor tours.",
    "details": [
      "Added scripts/seedTripAdvisorTours.ts to upsert Recharge TripAdvisor tours into the tours_tripadvisor collection using env or default Firebase config.",
      "Script writes title, pricing, ratings, links, operator profile URL, and timestamps so the TripAdvisor page/home highlights can pull from Firestore."
    ],
    "files": [
      "scripts/seedTripAdvisorTours.ts"
    ]
  },
  {
    "timestamp": "2025-11-29T00:00:00Z",
    "summary": "Fixed vehicle rental quick search so inputs drive browse results.",
    "details": [
      "Bound quick search inputs on the vehicle rental landing page to state and navigate with query params (type, city, dates, withDriver, delivery) into vehicle browse.",
      "Replaced static link with a form submit handler and aligned vehicle type options to VehicleBrowse filters."
    ],
    "files": [
      "src/pages/vehicle-rental/VehicleRental.tsx"
    ]
  },
  {
    "timestamp": "2025-11-28T12:55:09Z",
    "summary": "Unblocked quick search inputs on Vehicle Rental hero.",
    "details": [
      "Made hero background layers non-interactive (pointer-events-none) so the Vehicle Type and other quick search fields are clickable/typable."
    ],
    "files": [
      "src/pages/vehicle-rental/VehicleRental.tsx"
    ]
  },
  {
    "timestamp": "2025-11-28T12:57:10Z",
    "summary": "Constrained pickup locations to requested airports/cities and set default.",
    "details": [
      "Updated pickup location select to only list Bandaranaike Airport (CMB), Jaffna Airport (JAF), Colombo, Jaffna, Vavuniya, and Negombo; defaulted to Bandaranaike Airport."
    ],
    "files": [
      "src/pages/vehicle-rental/VehicleRental.tsx"
    ]
  },
  {
    "timestamp": "2025-11-28T13:01:39Z",
    "summary": "Split vehicle owner marketing into its own landing page and removed from rental page.",
    "details": [
      "Removed owner marketing block from vehicle rental landing to avoid duplication.",
      "Added dedicated owner landing page with provided messaging and CTAs, and routed at /vehicle-rental/owner."
    ],
    "files": [
      "src/pages/vehicle-rental/VehicleRental.tsx",
      "src/pages/vehicle-rental/OwnerLanding.tsx",
      "src/App.tsx"
    ]
  },
  {
    "timestamp": "2025-11-28T13:13:20Z",
    "summary": "Added Vehicle Owner Registration to About/Partners menu.",
    "details": [
      "Inserted the vehicle owner registration link into the About dropdown (Partners cluster) pointing to /vehicle-rental/owner."
    ],
    "files": [
      "src/components/header/navigation/menuData.ts",
      "src/components/header/navigation/AboutDropdown.tsx"
    ]
  },
  {
    "timestamp": "2025-11-28T13:14:53Z",
    "summary": "Enabled owner approval/rejection emails via SendGrid callable.",
    "details": [
      "Owner admin approval screen now sends decision emails through emailService (functions sendEmail) using info@rechargetravels.com; approval and rejection messages include owner ID and notes.",
      "Requires sendgrid.apikey in Firebase Functions config for live sends."
    ],
    "files": [
      "src/pages/admin/vehicle-rental/OwnerApproval.tsx"
    ]
  },
  {
    "timestamp": "2025-12-03T12:45:00Z",
    "summary": "Reverted LuxuryHeroSection to the earlier toggle-based booking widget after accidental homepage change.",
    "details": [
      "Restored the hero CTA toggle with quick-access chips and the scroll indicator instead of the always-open booking card.",
      "Undid the pinned-open menu so the booking card can be opened/closed per the prior experience; Book Now page remains untouched."
    ],
    "files": [
      "src/components/homepage/LuxuryHeroSection.tsx"
    ]
  },
  {
    "timestamp": "2025-12-03T12:30:27Z",
    "summary": "Made Book Now hero booking CTA permanently visible and anchored to the form.",
    "details": [
      "Added persistent Book Now buttons (inline and floating) in the Book Now hero to keep the booking CTA visible.",
      "Anchored the booking form with an ID so both CTAs scroll smoothly to the correct section."
    ],
    "files": [
      "src/pages/BookNow.tsx"
    ]
  },
  {
    "timestamp": "2025-12-03T13:05:00Z",
    "summary": "Removed the first Book Now hero image per request.",
    "details": [
      "Filtered hero slides to drop the first image from both Firebase and default slide sources.",
      "Adjusted the fallback current slide to start from the second default image."
    ],
    "files": [
      "src/pages/BookNow.tsx"
    ]
  },
  {
    "timestamp": "2025-12-03T13:35:22Z",
    "summary": "Redesigned Book Now page with premium hero, service cards, and WhatsApp booking modal.",
    "details": [
      "Added gradient hero with sticky header, quick search bar, and prominent CTAs.",
      "Built four service categories (Tours, Airport Transfers, Train Bookings, Vehicle Rentals) with rich cards, pricing, ratings, and highlights.",
      "Implemented WhatsApp-driven booking modal capturing traveler details and sending formatted messages to the concierge number."
    ],
    "files": [
      "src/pages/BookNow.tsx"
    ]
  },
  {
    "timestamp": "2025-12-03T13:52:06Z",
    "summary": "Simplified Book Now page: static hero and embedded existing booking engine tabs.",
    "details": [
      "Replaced the carousel with a single static hero image and CTA, per request.",
      "Embedded existing booking engine tabs for Airport Transfers, Private Tours, Group Transport, and Train Bookings using current forms.",
      "Kept contact info and sticky header/footer; removed custom cards and extra layers."
    ],
    "files": [
      "src/pages/BookNow.tsx"
    ]
  },
  {
    "timestamp": "2025-12-03T14:05:00Z",
    "summary": "Restored Book Now hero carousel with admin-managed slides (random start, up to 5).",
    "details": [
      "Re-enabled slide rotation with arrows/dots and gradients; starts at a random slide and auto-advances every 6s.",
      "Still skips the broken first default image; uses up to five valid slides from Firebase/defaults."
    ],
    "files": [
      "src/pages/BookNow.tsx"
    ]
  },
  {
    "timestamp": "2025-12-03T14:40:14Z",
    "summary": "Refreshed Cultural Tours hero and validated clean builds.",
    "details": [
      "Rebuilt /tours/cultural hero layering with a new Sigiriya backdrop, clearer gradient overlays, and isolated stacking so CTA buttons stay bright and clickable.",
      "Re-ran eslint plus npm run build:all (main + admin) to confirm the page and footers compile without Vite overlay errors."
    ],
    "files": [
      "src/pages/CulturalTours.tsx"
    ]
  },
  {
    "timestamp": "2025-12-03T15:15:21Z",
    "summary": "Stabilized homepage hero slides so all images load and stay visible.",
    "details": [
      "Skip srcSet for non-HTTP images and build query-safe srcsets for remote slides to prevent broken local hero images.",
      "Eager-load the currently visible slide so the first hero image doesn't flash out before the booking CTA shows."
    ],
    "files": [
      "src/components/homepage/LuxuryHeroSection.tsx"
    ]
  }
]
